thermalSimulations/emptyBox/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    frontAndBack
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1800;
        startFace       78300;
    }
    topAndBottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1800;
        startFace       80100;
    }
    inlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          900;
        startFace       81900;
    }
    back
    {
        type            wall;
        inGroups        1(wall);
        nFaces          900;
        startFace       82800;
    }
)

// ************************************************************************* //
