thermalSimulations/emptyBox/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

restore0Dir

runApplication blockMesh

# runApplication snappyHexMesh

runApplication $(getApplication)

#runApplication postProcess -func sample -latestTime

#if notTest "$@"
#then
#    runApplication validation/plot
#fi


#------------------------------------------------------------------------------
